Exchange mailbox exfiltration encompasses multiple legitimate features in Exchange Online, Exchange Server, Outlook, and Outlook on the web that threat actors abuse to forward, move, or delete messages. In most cases, the goal of the actor is to move messages sent to one or more compromised accounts within the tenant to a threat actor-controlled account without alerting the owners of the compromised accounts. This constitutes data exfiltration, which tenant administrators may be able to observe. 
Organizations can defend against Exchange mailbox exfiltration by restricting certain user permissions, monitoring relevant Exchange logs for unusual activity, and reviewing alerts generated by Microsoft Defender XDR.
Technique Overview
Exchange Online includes multiple mechanisms for forwarding or redirecting email. Microsoft has observed threat actors abuse these features to exfiltrate user email data. These threat actors include Emerald Sleet (THALLIUM), Forest Blizzard (STRONTIUM), and Midnight Blizzard (NOBELIUM).

SMTP forwarding 
In SMTP forwarding, Exchange Online automatically sends all messages addressed to a user’s inbox to the email address that the user specified, either internal or external to the tenant. There is also an option to automatically delete the messages from the user’s inbox upon forwarding. SMTP forwarding is available to users in Outlook on the web, or with a PowerShell script.  
A threat actor could abuse SMTP forwarding by gaining access to a user’s account and setting up SMTP forwarding to forward all messages addressed to that user to an actor-controlled account. 
Exchange Admins can restrict access to SMTP forwarding in the anti-spam policies section of Microsoft Defender XDR.  

Email rules 
The email rules feature is available in the Outlook application, Outlook on the web, or with a PowerShell script. Users can create rules for inboxes they control that forward, move, and delete messages, among other actions. Depending on the actions specified in the rule, the rule may run locally within the Outlook application or on the Exchange Online server. Similarly, users can create rules that run in the context of an out of office status.  
A threat actor could abuse email rules by gaining access to a user’s account and setting up email rules that forward some or all messages addressed to that user to an actor-controlled account. 
Disabling the Outlook email rules feature for users is not possible. However, Exchange Administrators can restrict out of office rule forwarding in the Exchange Admin Center (EAC). Exchange Administrators can also create mail flow rules in the EAC that detect and block outbound messages forwarded by email rules.  

Power Automate 
Power Automate is a Microsoft 365 app designed to automate repetitive actions in other Microsoft 365 apps, including Outlook. These include forwarding, moving, and deleting messages.  
A threat actor could abuse Power Automate by gaining access to a user’s account and creating Power Automate flows that forward some or all messages addressed to that user to an actor-controlled account. 
Tenants must license and enable the Power Automate app. However, it is not possible to restrict the specific capabilities of Power Automate available to users. Exchange Administrators can create mail flow rules in the EAC that detect and block outbound messages forwarded by Power Automate.  

Mail flow rules
Main flow rules (also known as transport rules) determine how Exchange Online or Exchange Server handles inbound and outbound messages across the tenant. Any user with the Organization Management permission can manage mail flow rules in the EAC or with a PowerShell script. By default, mail flow rules do not notify senders and recipients of messages affected by the rules.  
A threat actor could abuse mail flow rules by gaining access to an account with the Organization Management permission and creating mail flow rules that forward some or all messages handled by the Exchange Online tenant to an actor-controlled account. 
MITRE ATT&CK techniques observed 
This technique exhibits the use of the following attack techniques. For standard industry documentation about these techniques, refer to the MITRE ATT&CK framework. 
Execution 
T1059.001 Command and Scripting Interpreter: PowerShell
T1059.009 Command and Scripting Interpreter: Cloud API
Defense Evasion 
T1564.008 Hide Artifacts: Email Hiding Rules
Collection 
T1114.002 Email Collection: Remote Email Collection
T1114.003 Email Collection: Email Forwarding Rule
Exfiltration 
T1020 Automated Exfiltration
T1567.004 Exfiltration Over Web Service: Exfiltration Over Webhook
T1537 Transfer Data to Cloud Account

Detections/Hunting Queries
Microsoft Defender XDR Alerts with the following titles in the security center can indicate threat activity on your network:  
Suspicious email forwarding rule
Suspicious email forwarding rule created by third-party app
Suspicious inbox manipulation rule
Suspicious inbox rule creation originating from a suspicious IP

Microsoft Defender for Cloud Apps 
Alerts with the following titles in the security center can indicate threat activity on your network: 
App with high-level permissions accessed emails and created inbox rules
App with high-level permissions accessed email and created inbox rules
Suspicious email forwarding rule
Suspicious inbox manipulation rule

Microsoft Defender for Endpoint Alerts with the following title in the security center can indicate threat activity on your network: 
Exchange forwarding rules to external addresses

The following alerts might also indicate threat activity associated with this threat. These alerts, however, can be triggered by unrelated threat activity and are not monitored in the status cards provided with this report.  
Microsoft Defender for Cloud Apps 
Privileged app created inbox rules and accessed OneDrive or SharePoint

Microsoft Defender for Endpoint
Addition to Exchange Organization Management role group
Exchange mailbox or mail folder search using MailSniper
Global mail search on Exchange using MailSniper
Search for sensitive terms using Exchange PowerShell cmdlets
Unusual sequence of failed sign-in attempts in Exchange services
Unexpected Exchange transport agent installed​

Advanced hunting  
In the Microsoft Defender XDR portal, mailbox actions can be found in the ActionType field of the CloudAppEvents table. As mailbox actions are frequent, possible threat actor actions (such as New-InboxRule, Set-InboxRule, Set-Mailbox, Set-TransportRule, New-TransportRule, UpdateInboxRule) should be correlated with additional signals such as risky sign-in events. 
NOTE: The following sample queries let you search for 24 hours’ worth of events. To explore up to 30 days’ worth of raw data to inspect events in your network and locate potential Exchange exfiltration related indicators for more than a week, go to the Advanced hunting page > Query tab, select the calendar dropdown menu to update your query to hunt for the Last 30 days.    

'''Suspicious inbox rules by possibly compromised user 
The following query identifies certain mailbox actions and compares the user IP address to Entra ID-identified risky sign-in events. Run query
let mailBoxActions = pack_array("New-InboxRule", "Set-InboxRule", "Set-Mailbox", "Set-TransportRule", "New-TransportRule", "Enable-InboxRule");
//
let impactedUsers = AlertEvidence
| where isnotempty(AccountObjectId)
| distinct AccountObjectId;
//
let hasImpactedUsers = isnotempty(toscalar(impactedUsers));
//
let riskySignInSession = AADSignInEventsBeta
| where hasImpactedUsers
| where isnotempty(AccountObjectId)
| where isnotempty(IPAddress)
| where AccountObjectId in (impactedUsers)
| where IsManaged != 1
| where IsCompliant != 1
| where isempty(DeviceTrustType)
//
// Risk score is medium/high/low
//
| where RiskLevelDuringSignIn >= 10
| where isnotempty(SessionId)
| distinct SessionId;
//
let hasRiskySessions = isnotempty(toscalar(riskySignInSession));
//
CloudAppEvents
| where hasRiskySessions
| where isnotempty(AccountObjectId)
| where ApplicationId == 20893 //Microsoft Exchange Online
| where AccountObjectId in (impactedUsers)
| where ActionType in (mailBoxActions) //Filter only for Inbox rule creation activities
| where RawEventData has_any (riskySignInSession) //RawEventData has the session Id for the risky sign-in
| project Timestamp, ReportId, ActionType, IPAddress, AccountObjectId, ISP, CountryCode
'''

Recommendations
Microsoft recommends the following mitigations to reduce the impact of this threat. Check the recommendations card for the deployment status of monitored mitigations.  
Review Microsoft’s guide to restricting email forwarding with mail flow rules. Mail flow rules do not restrict users’ access specific features. However, Exchange Administrators can use granular mail flow rules to detect and block outbound messages forwarded with inbox rules, out of office rules, and Power Automate flows. Mail flow rules can also alert users when their outbound messages are blocked by policy.
Monitor email security reports in Microsoft Defender for Office 365 for evidence of abnormal mail flow, which may indicate the presence of unwanted mail flow rules.
Restrict access to SMTP forwarding with an outboard spam filter policies in Microsoft 365 Defender.
Restrict out of office forwarding in the EAC.
Restrict access to the Organization Management permission.
Implement data loss prevention (DLP) policies in Microsoft Purview.
Enforce multifactor authentication (MFA) on all accounts, remove users excluded from MFA, and strictly require MFA from all devices, in all locations, at all times.
Enable passwordless authentication methods (for example, Windows Hello, FIDO keys, or Microsoft Authenticator) for accounts that support passwordless. For accounts that still require passwords, use authenticator apps like Microsoft Authenticator for MFA. Refer to this article for the different authentication methods and features.
